app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("created_at", "decription", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 18 Oct 2013 21:36:22 UTC +00:00], ["decription", "b"], ["name", "a"], ["picture", "amor.jpeg"], ["updated_at", Fri, 18 Oct 2013 21:36:22 UTC +00:00]]

  def destroy
    @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 2]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "2"]]